Autodesk.Revit.DB.BuiltInFailures.KeyBasedTreeFileFailures.CannotUnderstandAtLine
Cannot understand [EntryType] line '[Number]'

Autodesk.Revit.DB.BuiltInFailures.KeyBasedTreeFileFailures.CannotOpenFileForRead
Cannot open file [FileName].

Autodesk.Revit.DB.BuiltInFailures.KeyBasedTreeFileFailures
Failures occurred when reading key based tree text file.